In [74]:
pip install psycopg2-binary

Requirement already satisfied: psycopg2-binary in /opt/anaconda3/lib/python3.7/site-packages (2.9.9)
Note: you may need to restart the kernel to use updated packages.

In [75]:
import pandas as pd 
from sqlalchemy import create_engine

In [76]:
df = pd.read_csv("data/car_insurance_claim-1.csv")

In [77]:
df.head(2)

,ID,KIDSDRIV,BIRTH,AGE,HOMEKIDS,YOJ,INCOME,PARENT1,HOME_VAL,MSTATUS,...,CAR_TYPE,RED_CAR,OLDCLAIM,CLM_FREQ,REVOKED,MVR_PTS,CLM_AMT,CAR_AGE,CLAIM_FLAG,URBANICITY
0,63581743,0,16MAR39,60.0,0,11.0,"$67,349",No,$0,z_No,...,Minivan,yes,"$4,461",2,No,3,$0,18.0,0,Highly Urban/ Urban
1,132761049,0,21JAN56,43.0,0,11.0,"$91,449",No,"$257,252",z_No,...,Minivan,yes,$0,0,No,0,$0,1.0,0,Highly Urban/ Urban

In [78]:
df.shape

(10302, 27)

In [79]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10302 entries, 0 to 10301
Data columns (total 27 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   ID          10302 non-null  int64
 1   KIDSDRIV    10302 non-null  int64
 2   BIRTH       10302 non-null  object
 3   AGE         10295 non-null  float64
 4   HOMEKIDS    10302 non-null  int64
 5   YOJ         9754 non-null   float64
 6   INCOME      9732 non-null   object
 7   PARENT1     10302 non-null  object
 8   HOME_VAL    9727 non-null   object
 9   MSTATUS     10302 non-null  object
 10  GENDER      10302 non-null  object
 11  EDUCATION   10302 non-null  object
 12  OCCUPATION  9637 non-null   object
 13  TRAVTIME    10302 non-null  int64
 14  CAR_USE     10302 non-null  object
 15  BLUEBOOK    10302 non-null  object
 16  TIF         10302 non-null  int64
 17  CAR_TYPE    10302 non-null  object
 18  RED_CAR     10302 non-null  object
 19  OLDCLAIM    10302 non-null  object
 20  CLM_FREQ    10302 non-null  int64
 21  REVOKED     10302 non-null  object
 22  MVR_PTS     10302 non-null  int64
 23  CLM_AMT     10302 non-null  object
 24  CAR_AGE     9663 non-null   float64
 25  CLAIM_FLAG  10302 non-null  int64
 26  URBANICITY  10302 non-null  object
dtypes: float64(3), int64(8), object(16)
memory usage: 2.1+ MB

In [80]:
#Duplicate Row Counts:
df.duplicated(subset=['ID'], keep=False).value_counts()

False    7421
True     2881
dtype: int64

In [81]:
# Check for duplicate rows and pront the duplicated row
#df[df.duplicated()]


# drop duplicate rows
#df_no_duplicate = df.drop_duplicates()
#df_no_duplicate.head()

In [82]:
duplicate_rows = df[df.duplicated(subset=['ID'], keep=False)]
duplicate_rows

,ID,KIDSDRIV,BIRTH,AGE,HOMEKIDS,YOJ,INCOME,PARENT1,HOME_VAL,MSTATUS,...,CAR_TYPE,RED_CAR,OLDCLAIM,CLM_FREQ,REVOKED,MVR_PTS,CLM_AMT,CAR_AGE,CLAIM_FLAG,URBANICITY
10,892208080,1,14DEC61,37.0,2,NaN,"$107,961",No,"$333,680",Yes,...,Van,yes,"$2,374",1,Yes,10,"$4,021",7.0,1,Highly Urban/ Urban
14,989828809,0,19JUN56,43.0,0,5.0,"$52,642",No,"$209,970",Yes,...,Minivan,no,$0,0,No,0,$0,1.0,0,z_Highly Rural/ Rural
16,665591504,0,19JUL46,53.0,0,11.0,"$130,795",No,$0,z_No,...,Panel Truck,yes,$0,0,No,3,"$1,267",10.0,1,Highly Urban/ Urban
17,713692930,0,17AUG64,35.0,2,NaN,"$21,204",Yes,$0,z_No,...,Pickup,no,$0,0,Yes,0,$0,4.0,0,z_Highly Rural/ Rural
20,162166370,0,19APR40,59.0,0,12.0,"$87,460",No,$0,z_No,...,Minivan,yes,"$44,857",2,No,4,"$4,111",1.0,1,Highly Urban/ Urban
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
10286,510001503,0,03MAY39,60.0,0,12.0,"$19,796",No,"$153,061",z_No,...,Sports Car,no,"$2,800",2,No,4,$0,1.0,0,Highly Urban/ Urban
10291,813128,1,14FEB53,46.0,0,12.0,"$45,018",No,$0,z_No,...,Minivan,no,"$33,026",3,No,0,$0,1.0,0,z_Highly Rural/ Rural
10292,452807843,0,19DEC50,48.0,0,10.0,"$111,305",No,$0,z_No,...,z_SUV,no,$0,0,No,4,$0,18.0,0,Highly Urban/ Urban
10298,61970712,0,17JUN53,46.0,0,9.0,"$107,204",No,"$332,591",Yes,...,Panel Truck,no,$0,0,No,0,$0,1.0,0,Highly Urban/ Urban
10300,627828331,0,12DEC48,50.0,0,7.0,"$43,445",No,"$149,248",Yes,...,Minivan,no,$0,0,No,0,$0,11.0,0,Highly Urban/ Urban

In [83]:
df = df.drop_duplicates(subset=['ID'], keep='first')

In [84]:
df.shape

(8753, 27)

In [85]:
# Split the DataFrame into full_df (80%) and increment_df (20%)
full_df, increment_df = train_test_split(df, test_size=0.2, random_state=42)

In [86]:
print('full load data:',full_df.shape)
print('incremental load:',increment_df.shape)

full load data: (7002, 27)
incremental load: (1751, 27)

# full load to postgresql testdb

In [87]:
# host the database on aws ec2 instance 
# Database connection details for AWS EC2 instance

database_url = 'postgresql://consultants:WelcomeItc@2022@ec2-3-9-191-104.eu-west-2.compute.amazonaws.com:5432/testdb'

table_name = 'car_insurance_claims'

# Create a SQLAlchemy engine to connect to the database
engine = create_engine(database_url)

# Push DataFrame to the database
full_df.to_sql(name=table_name, con=engine, index=False, if_exists='replace')

In [88]:
full_df.shape

(7002, 27)

# load increment df to testdb

In [89]:
# Push increment_df to the database
increment_df.to_sql(name=table_name, con=engine, index=False, if_exists='append')

# Close the database connection
engine.dispose()

In [90]:
increment_df.shape

(1751, 27)